tema-mazy/mazy-iot/esp32/test/eink-test/sdkconfig.defaults
# LilyGO T5 V2.3 carries an ESP32-WROVER-B (4 MB flash, 8 MB PSRAM).
CONFIG_IDF_TARGET="esp32"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_CSV_PATH="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# The e-paper refresh is slow; give the main task room and a relaxed WDT.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Open-Meteo is HTTPS, so pull in the root cert bundle.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
